clear all;
close all;
clc;
%% 冲激函数注射
v1=20;k21=1;k12=0.2;k31=0.1;k13=0.009;k01=0;k02=0.02;k03=0.001;
f=@(t,q)[k13*q(3)+k12*q(2)-k01*q(1)-k31*q(1)-k21*q(1);k21*q(1)-k12*q(2)-k02*q(2);k31*q(1)-k13*q(3)-k03*q(3)];
tspan=0:600;
q0=[1,0,0];  %u1=dirac(t)这一块还是体现在初值上算了


[t,q]=ode45(f,tspan,q0);
plot(t,q(:,1)/v1,t,q(:,2)/v1,t,q(:,3)/v1)  %题干中没有提供其他房室的体积。此处默认一致
legend('房室q1', '房室q2','房室q3');
xlabel('时间');
ylabel('房室药物浓度');

%% 阶跃函数注射，且一直保持注射
v1=20;k21=1;k12=0.2;k31=0.1;k13=0.009;k01=0;k02=0.02;k03=0.001;u1=1;
f=@(t,q)[u1+k13*q(3)+k12*q(2)-k01*q(1)-k31*q(1)-k21*q(1);k21*q(1)-k12*q(2)-k02*q(2);k31*q(1)-k13*q(3)-k03*q(3)];
tspan=0:600;
q0=[1,0,0];  %阶跃初值体现

[t,q]=ode45(f,tspan,q0);
plot(t,q(:,1)/v1,t,q(:,2)/v1,t,q(:,3)/v1)  %题干中没有提供其他房室的体积。此处默认一致
legend('房室q1', '房室q2','房室q3');
xlabel('时间');
ylabel('房室药物浓度');

%%  阶跃函数注射，仅仅在0-20s内注射
v1=20;k21=1;k12=0.2;k31=0.1;k13=0.009;k01=0;k02=0.02;k03=0.001;
u1 = 0; % 初始时刻开始注射
t_injection = 20; % 阶跃函数注射结束的时间
u1 = 1; % 注射量
f=@(t,q)[(t <= t_injection) * u1+k13*q(3)+k12*q(2)-k01*q(1)-k31*q(1)-k21*q(1);k21*q(1)-k12*q(2)-k02*q(2);k31*q(1)-k13*q(3)-k03*q(3)];
tspan=0:600;
q0=[1,0,0];  %同上阶跃体现初值


[t,q]=ode45(f,tspan,q0);
plot(t,q(:,1)/v1,t,q(:,2)/v1,t,q(:,3)/v1)  %题干中没有提供其他房室的体积。此处默认一致
legend('房室q1', '房室q2','房室q3');
xlabel('时间');
ylabel('房室药物浓度');


